In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
df = pd.read_csv('Data/title_basics.csv.gz')

# Transformation Steps

In [3]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [4]:
df = df.explode('genres_split')
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...
136237,tt9916190,movie,Safeguard,Safeguard,0,2020,95,"Action,Adventure,Thriller",Thriller
136238,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,84,Thriller,Thriller
136239,tt9916362,movie,Coven,Akelarre,0,2020,92,"Drama,History",Drama
136239,tt9916362,movie,Coven,Akelarre,0,2020,92,"Drama,History",History
136240,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,123,Drama,Drama

In [5]:
unique_genres = sorted(df['genres_split'].unique())

In [6]:
##create title_genres table
title_genres = df[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
## make new integer genre_id and drop string genres
df['genre_id'] = df['genres_split'].replace(genre_map)
df = df.drop(columns='genres_split')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genre_id
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",5
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",9
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",18
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,7
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,7

In [9]:
##now the title_genres table is ready
title_genres = df[['tconst', 'genre_id']].copy()
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [10]:
# now the genres table is ready
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [22]:
#title_basics table is ready
df2 = pd.read_csv('Data/title_basics.csv.gz')
title_basics = df2.drop(columns=['originalTitle', 'isAdult', 'titleType', 'genres'])
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0079644,November 1828,2001,140
4,tt0088751,The Naked Monster,2005,100

In [12]:
title_ratings = pd.read_csv('Data/title_rating.csv.gz')

# Create Movies database

In [13]:
connection_str = "mysql+pymysql://root:Yishengyouni520!@localhost/movies2"

In [14]:
engine = create_engine(connection_str)

In [15]:
create_database(connection_str)

In [23]:
#create tables
title_basics.to_sql('title_basics', engine, if_exists = 'replace')
title_ratings.to_sql('title_ratings', engine, if_exists = 'replace')
title_genres.to_sql('title_genres', engine, if_exists = 'replace')
genres.to_sql('genres', engine, if_exists = 'replace')

26

In [17]:
#show all tables
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies2
0            genres
1      title_basics
2      title_genres
3     title_ratings

In [18]:
#testing one table
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

   index     tconst  averageRating  numVotes
0      0  tt0000001            5.7      1910
1      1  tt0000002            5.8       256
2      2  tt0000005            6.2      2528
3      3  tt0000006            5.1       173
4      4  tt0000007            5.4       789

## Saving the MySQL tables with tconst as the primary key.

In [24]:

from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [25]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

136241

In [26]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')